# parameters
nc: 10  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# yolov7-tiny backbone
backbone:
  # [from, number, module, args] c2, k=1, s=1, p=None, g=1, act=True
  [[-1, 1, Conv, [32, 3, 2, None, 1, nn.LeakyReLU(0.1)]],  # 0-P1/2  
  
   [-1, 1, Conv, [64, 3, 2, None, 1, nn.LeakyReLU(0.1)]],  # 1-P2/4    

   [-1, 1, Yolov7_Tiny_E_ELAN, [64, 32, nn.LeakyReLU(0.1)]], # 2

   [-1, 1, MP, []],  # 3-P3/8
   [-1, 1, Yolov7_Tiny_E_ELAN, [128, 64, nn.LeakyReLU(0.1)]], # 4

   [-1, 1, MP, []],  # 5-P4/16
   [-1, 1, Yolov7_Tiny_E_ELAN, [256, 128, nn.LeakyReLU(0.1)]], # 6

  ]

# yolov7-tiny head
head:
  [[-1, 1, Yolov7_Tiny_SPP, [256, nn.LeakyReLU(0.1)]], # 7-Yolov7-tiny-spp

   [-1, 1, RFB_U, [256]],
   
   [-1, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]], 
   [-1, 1,  CARAFE, [1,5]],

   [4, 1, Conv, [128, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # route backbone P3   11
   [[-1, -2 , 2], 1, Detail_Fusion_cat, []],
   [-1, 1, Yolov7_Tiny_E_ELAN, [128, 64, nn.LeakyReLU(0.1)]], # 13

   [-1, 1,  Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # 13
   [-1, 1,  CARAFE, [1,5]],
   [2, 1, Conv, [64, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # route backbone P2   15
   [[-1, -2 , 0], 1, Detail_Fusion_cat, []],   
   [-1, 1, Yolov7_Tiny_E_ELAN, [64, 32, nn.LeakyReLU(0.1)]], # 17
   
   [-1, 1, Conv, [128, 3, 2, None, 1, nn.LeakyReLU(0.1)]], 
   [[-1, 13 , 2], 1, Detail_Fusion_cat, []],
   [-1, 1, Yolov7_Tiny_E_ELAN, [128, 64, nn.LeakyReLU(0.1)]], # 20

   [-1, 1, Conv, [256, 3, 2, None, 1, nn.LeakyReLU(0.1)]],
   [[-1, 8 , 4], 1, Detail_Fusion_cat, []],
   [-1, 1, Yolov7_Tiny_E_ELAN, [256, 128, nn.LeakyReLU(0.1)]], # 23

#  ASFF128
   [24, 1, Conv, [192, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # 24
   [-1, 1,  carafeAndReduceChannels, [96]],    # 25
   [-1, 1,  carafeAndReduceChannels, [48]],    # 26

   [21, 1, Conv, [96, 1, 1, None, 1, nn.LeakyReLU(0.1)]],     # 27
   [-1, 1, Conv, [192, 3, 2, None, 1, nn.LeakyReLU(0.1)]],    # 28
   [-2, 1,  carafeAndReduceChannels, [48]],    # 29

   [18, 1, Conv, [48, 1, 1, None, 1, nn.LeakyReLU(0.1)]], # 30
   [-1, 1, Conv, [96, 3, 2, None, 1, nn.LeakyReLU(0.1)]],   # 31
   [-2, 1, MP, []],  # 3-P3/8
   [-1, 1, Conv, [192, 3, 2, None, 1, nn.LeakyReLU(0.1)]],  # 33

   [[25, 29, 34], 1, ASFF_3, [192,192]],   # 34    level 3
   [[26, 28, 32], 1, ASFF_3, [96,96]],     # 35    level 2
   [[27, 30, 31], 1, ASFF_3, [48,48]],     # 36    level 1

   [-1, 1, Conv, [128, 3, 1, None, 1, nn.LeakyReLU(0.1)]], # 24-P3
   [-3, 1, Conv, [256, 3, 1, None, 1, nn.LeakyReLU(0.1)]], # 25-P3
   [-5, 1, Conv, [512, 3, 1, None, 1, nn.LeakyReLU(0.1)]], # 26-P4

   [[38, 39, 40], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]